In [18]:
import psycopg2
from sqlalchemy import create_engine
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [20]:
engine = create_engine('postgresql://user:pass@localhost/umuzi')

In [4]:
connection = psycopg2.connect(user = "user",
                                  password = "pass",
                                  host = "localhost",
                                  port = "5432",
                                  database = "umuzi")

In [5]:
cursor = connection.cursor()

In [10]:
cursor.execute('SELECT * FROM customers')
a = cursor.fetchall()
connection.commit()

In [11]:
a

[(3,
  'Leon',
  'Glen',
  'Male',
  '81 Everton Rd,Gillits',
  '820832830',
  'Leon@gmail.com',
  'Durban',
  'South Africa'),
 (4,
  'Charl',
  'Muller',
  'Male',
  '290A Dorset Ecke',
  '44856872553',
  'Charl.muller@yahoo.com',
  'Berlin',
  'Germany'),
 (5,
  'Julia',
  'Stein',
  'Female',
  '2 Wernerring',
  '448672445058',
  'Js234@yahoo.com',
  'Frankfurt',
  'Germany'),
 (1,
  'Lerato',
  'Mabitso',
  'Male',
  '284 chaucer st',
  '84789657',
  'john@gmail.com',
  'Johannesburg',
  'South Africa')]

In [21]:
import pandas as pd

In [23]:
pd.read_sql('SELECT * from customers',engine)

,customerid,firstname,lastname,gender,address,phone,email,city,country
0,3,Leon,Glen,Male,"81 Everton Rd,Gillits",820832830,Leon@gmail.com,Durban,South Africa
1,4,Charl,Muller,Male,290A Dorset Ecke,44856872553,Charl.muller@yahoo.com,Berlin,Germany
2,5,Julia,Stein,Female,2 Wernerring,448672445058,Js234@yahoo.com,Frankfurt,Germany
3,1,Lerato,Mabitso,Male,284 chaucer st,84789657,john@gmail.com,Johannesburg,South Africa